a9650615/esp32-rlcd-standalone/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_FREERTOS_HZ=1000
# The initial LVGL object tree is built synchronously from app_main so startup
# failures can stop before the carousel timer is armed. The ESP-IDF default
# 3584-byte main-task stack overflows while rendering the first full page.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_QRCODE=y
# Wi-Fi setup portal: open captive AP + a 2-field HTTP form, no long POST
# bodies expected, but LWIP's default socket count is tight once the DNS
# responder's UDP socket and the setup AP's client join the HTTP listener.
CONFIG_LWIP_MAX_SOCKETS=16
